In [1]:
def func(n):
    for i in n:
        print(i)
names = ['Vinay','Sunny','Bunny']
func(names)

Vinay
Sunny
Bunny

In [2]:
import pandas as pd

In [3]:
df = pd.read_excel('Book1.xlsx')

In [4]:
df

   Names  Age
0  Vinay   20
1  Sunny   24
2  Bunny   18

In [9]:
df.iloc[0,:]

Names    Vinay
Age         20
Name: 0, dtype: object